wipo-unisa/IPSP01X - Essential Copyright Law/assignments/NLisa_Assignment_02.tex
% Created 2017-04-24 Mon 20:03
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.56in]{geometry}
\usepackage[backend=bibtex, style=ieee]{biblatex}
\addbibresource{/home/nuk3/course/training/csir/novellasers/bibliography/bibliography.bib}
\DeclareFieldFormat[inproceedings]{citetitle}{\textit{#1}}
\DeclareFieldFormat[inproceedings]{title}{\textit{#1}}
\DeclareFieldFormat[misc]{citetitle}{#1}
\DeclareFieldFormat[misc]{title}{#1}
\renewcommand*{\bibpagespunct}{%
\ifentrytype{inproceedings}
{\addspace}
{\addcomma\space}}
\AtEveryCitekey{\ifuseauthor{}{\clearname{author}}}
\AtEveryBibitem{\ifuseauthor{}{\clearname{author}}}
\author{Nyameko Lisa}
\date{\today}
\title{IPSP01X - Essential Copyright Law\\\medskip
\large Assignment 2 - Unique Number: 773723}
\hypersetup{
 pdfauthor={Nyameko Lisa},
 pdftitle={IPSP01X - Essential Copyright Law},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.2.1 (Org mode 9.0.5)},
 pdflang={English}}
\begin{document}

\maketitle
\section*{Declaration}
\label{sec:orga9c989b}
\begin{itemize}
\item I know that plagiarism is to use someone else’s work and pass it off as my own.
\item I know that plagiarism is wrong.
\item I confirm that this assignment is my own work.
\item I have acknowledged in the bibliography accompanying the assignment all the sources that I have used.
\item I have not directly copied without acknowledgement anything from the Internet or from any other source.
\item I have indicated every quotation and citation in a footnote or bracket linked to that quotation.
\item I have not allowed anyone else to copy my work and to pass it off as their own work.
\item I understand that if any unacknowledged copying whatsoever appears in my assignment I will receive zero per cent for the assignment.
\item I am aware of the UNISA policy on plagiarism and understand that disciplinary proceedings can be instituted against me by UNISA if I contravene this policy.
\item I indicate my understanding and acceptance of this declaration by
entering my name hereunder:
\begin{itemize}
\item Name: \textbf{Nyameko Lisa} (Student Number: \textbf{7874-909-3})
\end{itemize}
\end{itemize}

\subsection*{NOTE}
\label{sec:orgac2907a}
Please note that footnotes will be denoted as \footnote{This is a footnote.} and will
appear at the bottom of the page.\\
References will be denoted by \cite{rsa78_copyrightact} and will appear at the end of the document.
\newpage

\section{Henry is a junior programmer at XYZ Software.}
\label{sec:org025a809}
\subsection{Who is the author and who is the copyright owner in the programs? [6]}
\label{sec:orga0003a7}
According to [article 10(1)]\cite{wto17_trips} and [article
4]\cite{wipo96_copyright_treaty}, computer programs are protected as `literary
works' as defined in [article 2]\cite{wipo86_berne}. Moreover as per the
definition in [section 1]\cite{rsa78_copyrightact}, Meagan is the author of the
work. As Henry's supervisor she exercised control over the making of the
computer program.\\

Meagan authored the program during the course of her employment by XYZ, it
follows by [section 21(d)]\cite{rsa78_copyrightact}, that XYZ owns the copyright.
\subsection{What is the duration of copyright in a computer program? [2]}
\label{sec:org84556b4}
As per [section 3(2)(b)]\cite{rsa78_copyrightact}, the longer term between fifty
years from the end of the year in which the work is either first published or
made publicly available with the author's consent. Or should neither be
satisfied then fifty years from the end of the year in which the work is made.
\subsection{Can the Reverse engineering exception [section 15(3A)]\cite{rsa78_copyrightact} apply to computer programs? [2]}
\label{sec:orge6b012c}
No. As per [section 19B(2)(c)]\cite{rsa78_copyrightact}, copyright will be
infringed unless one is in lawful possession of a computer program or
authorised copy thereof, moreover one destroys such copies when they cease to
be lawful.
\section{Explain the importance of [section 21(1)(e)]\cite{rsa78_copyrightact}. [5]}
\label{sec:orgedc7bd8}
[section 21(1)(b-d)]\cite{rsa78_copyrightact} stipulate ownership of
copyright. In particular, should the work have been undertaken during the
course of employment or contract or commission or apprenticeship, the ownership
of the copyright will vest with the proprietor of the institution (or commissioner)
requesting / paying for the work. The importance of the clause, is that the
owner of the copyright s subject to the Moral Rights clause [section
20(1)]\cite{rsa78_copyrightact}, and thus cannot adapt the work in such a way as
to bring the original author's honour or reputation into disrepute. This will
amount to infringement of copyright, [section 20(2)]\cite{rsa78_copyrightact},
and the author can claim ownership of the copyright in question.
\section{Does this constitute moral rights infringement? [10]}
\label{sec:orgbe57fd1}
As per [section 1]\cite{rsa78_copyrightact} the photo constitutes an
\uline{artistic work}. Moreover as per [section 1(1)(c)]\cite{rsa78_copyrightact}, the
photo appearing in the magazine's October issue constitutes a \uline{adaptation} of
Ringo's original work. Ringo is the original author of the photograph,
responsible for it's original composition; and he is also the first owner of the copyright that subsists in that work [section 21(1)(a).\\

By submitting his photograph as an entry in the competition, as per [section
7(a-b)]\cite{rsa78_copyrightact}, Ringo authorized\footnote{Pending further
investigation of the competition's terms and conditions} the magazine to
publish and / or reproduce the photograph in their August edition.\\

However, as per [section 7(e-f)]\cite{rsa78_copyrightact}, is was unlawful for
the magazine to make an adaptation of Ringo's photo and publish said
adaptation without either consent from the copyright owner nor acknowledgement
of the original author.\\

Should Ringo be able to demonstrate that the October edition of the magazine
and its depiction of the adapted photograph is prejudicial to his honour or
reputation, provided he did not agree to transfer the copyright of the photo
when entering the competition, then as per [section 20
(1-2)]\cite{rsa78_copyrightact}, he can claim authorship of the work, argue that
the magazine infringed on his moral rights, that they also infringed on
his copyright, and finally he could argue that they be liable for damages and
/ or royalties.
\section{Identify three exceptions in [section 12]\cite{rsa78_copyrightact} that can possibly excuse copyright infringement. [3]}
\label{sec:org2e91687}
Newspaper B can argue that they have not infringed on Newspaper A's copyright:
\begin{enumerate}
\item As per [section 12(7)]\cite{rsa78_copyrightact}, provided that the content
was a current economic, political or religious topic, Newspaper B did not
infringe copyright, as long as they mentioned the source and Newspaper A
has not expressly reserved the copyright in that article,
\item As per [section 12(8)(a), if the content was news of the day that amounts
to mere items of press information, then no copyright shall subsist in
Newspaper A's content.
\item As per [section 12(3)]\cite{rsa78_copyrightact}, quotations from articles in
newspapers do not infringe copyright provided these quotations constitute
\emph{fair use}, and that the original source and authors are mentioned.
\item As per [section 12(1)(b)]\cite{rsa78_copyrightact} their use of the content
in question constitutes fair dealing and for the purposes of criticism or
review of that content or another work, and as per [section
12(c)(i)]\cite{rsa78_copyrightact}, for the purpose of reporting current
events in a newspaper; provided that the original source and author where mentioned,
\item As per [section 12(2)]\cite{rsa78_copyrightact}, had the content been judicial proceedings, that could argue that their reproduction of the content was to report on judicial proceedings.
\end{enumerate}

\section{Copyright shall not be infringed by any quotation from a work which is lawfully available to the public. [10]}
\label{sec:org4e78030}
\subsection{Name the section and list the requirements that deal with this defence. \label{subsec:defence_public_quotations}}
\label{sec:orgb877cc9}

Section 12. General exceptions from protection of literary and musical works,
subsection 3. As per [section 12(3)]\cite{rsa78_copyrightact}, for this particular defence it is required that:
\begin{itemize}
\item the quotation is compatible with \emph{fair practice} or that it constitutes
\emph{fair use},
\item the extent to which the quotation is implemented does not exceed the extent
justified by the purpose,
\item the source is mentioned in the quotation,
\item the name of the author shall be mentioned should it appears on the work.
\end{itemize}
\subsection{Does answer in \ref{subsec:defence_public_quotations}, differ from requirements set out in [article 10(1),10(3)] \cite{wipo86_berne}?}
\label{sec:org5499b46}
No, the two legal instruments corroborate one another.
\subsection{Why are \cite{rsa78_copyrightact} and \cite{wipo86_berne} so similar?}
\label{sec:org53e39ab}
All members of the World Trade Organization are obliged to comply with the
substantive provisions in \cite{wipo86_berne}. Moreover South Africa is a Berne
Convention member Union country. Naturally it would follow that the Copyright
Act of South Africa would therefore at the very least comply with, if not
directly resemble the Berne Convention.
\section{What are the requirements for the assignment (transfer) of copyright? [2]}
\label{sec:org61e64d1}
As per [section 22(1)]\cite{rsa78_copyrightact}, one can transfer or assign
copyright as movable property by assignment, testamentary disposition, or
operation of law. However as per [section 22(3)]\cite{rsa78_copyrightact}, the
assignment of copyright shall have effect only if it is in writing and signed by
or on behalf of the corresponding assignor.
\section{Name and briefly explain the remedies for copyright infringements. [10]}
\label{sec:org5e1b1b7}
As per [section 24(1)]\cite{rsa78_copyrightact}, at the suit
of the owner of a copyright and as per [section 25(1)]\cite{rsa78_copyrightact},
at the suit of the exclusive (sub-)licensee of the copyright, one may take
action against infringements of that copyright, where the plaintiff may be
awarded relief by way of:
\subsection{Damages}
\label{sec:org50e3e7f}
As per [section 24(1),(1A),(1B)]\cite{rsa78_copyrightact}, the plaintiff
may be entitled to damages or royalties in lieu of damages, where the court
may direct an enquiry to determine a reasonable amount at its
discretion. However, should the defendant prove that at the time the
copyright infringement occurred, he was neither aware nor had any reasonable
grounds to suspect that copyright subsisted in the work, then the plaintiff
shall not be entitled to any damages as per [section 24(2)]\cite{rsa78_copyrightact}.
\subsection{Interdict}
\label{sec:org68ed5d1}
As per [section 24(1)]\cite{rsa78_copyrightact}, the court may direct the
defendant to cease exploitation of the infringing copies.
\subsection{Delivery of infringing copies}
\label{sec:org018a9f0}
As per [section 24(1)]\cite{rsa78_copyrightact}, the court may direct the
defendant to provide the plaintiff with all infringing copies, all plates
used or intended to be used for infringing copies or otherwise.
\subsection{Fine}
\label{sec:org67448b5}
As per [section 27(6)(a-b)]\cite{rsa78_copyrightact}, should a defendant be
convicted of infringing the plaintiff's copyright, he'll be liable to a fine
and / or imprisonment for each article to which the offence relates:
\begin{itemize}
\item a fine not exceeding five thousand rand and / or imprisonment up to three
years in the case of a first conviction,
\item a fine not exceeding ten thousand rand and / or imprisonment up to five years.
\end{itemize}
\subsection{Restriction on the importation of goods}
\label{sec:orgc7acb13}
As per [section 28(1)]\cite{rsa78_copyrightact} the owner of the copyright in
any published work may request the Commissioner for Customs and Excise to
treat infringing copies as prohibited goods, provided they were made
outside\footnote{It would constitute and infringing copy had it been made within
the Republic.} the Republic, [section 28(2)]. As per [section
28(4)]\cite{rsa78_copyrightact} the infringer will not be liable for any
penalties under the Customs and Excise Act No. 91 of 1964, other than the
forfeiture of any \emph{prohibited} goods.
\printbibliography
\end{document}
